aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio before cleanup.c
    /* Enable the SDIO Clock */

    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_CLK_ENABLE();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_CLK_ENABLE();
    }
    #endif
#if(0) //ifndef(WICED)
    //ANN added below
    #if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
     		 //Enable clocks for SDIO and DMA2
   			//rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_SDIOEN);
     		 //__HAL_RCC_PWR_CLK_ENABLE();

    		 //Enable the SDIO APB2 Clock
    		  //RCC_APB2PeriphClockCmd(RCC_APB2ENR_SDIOEN, ENABLE);

    		//__HAL_RCC_SDIO_CLK_ENABLE();
    	do {
    	   __IO uint32_t tmpreg;
    	   //SET_BIT(RCC->AHB2ENR, 0x00000200);
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);
    	}
    }
    #endif
#endif //if(0)


    /* Initialize SDMMC peripheral interface with default configuration */
    //(void)SDMMC_Init(obj->hsd->Instance, obj->hsd->Init);

      //obj->hsd->Init.ClockDiv = (uint32_t)0x76;

      (void)SDIO_Init(obj->hsd->Instance, obj->hsd->Init);

    /* Set Power State to ON */
    //(void)SDMMC_PowerState_ON(obj->hsd->Instance);
    (void)SDIO_PowerState_ON(obj->hsd->Instance);
//#if(0)
    /* Wait clock */
    //(void)SDMMC_SetSDMMCReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);
    (void)SDIO_SetSDMMCReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);
    //(void)SDIO_SetSDIOReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);


    //uint32_t sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC) /
    //                     (2U * obj->hsd->Init.ClockDiv);


//#endif
    uint32_t sdmmc_clk = LL_RCC_GetSDIOClockFreq(LL_RCC_SDIO_CLKSOURCE) /
                        (/*2U **/ obj->hsd->Init.ClockDiv);


    if (sdmmc_clk != 0U)
    {
        /* Wait 74 Cycles: required power up waiting time
         * before starting the SD initialization sequence */
        HAL_Delay(1U + (74U * 1000U / (sdmmc_clk)));
    }
    else
    {
        HAL_Delay(2U);
    }

}

/***************************************************************************************************
 * _stm32_sdio_disable_hw_block
 **************************************************************************************************/
static void _stm32_sdio_disable_hw_block(const cyhal_sdio_t* obj)
{
    /* Reset SDIO Block */
    //(void)SDMMC_PowerState_OFF(obj->hsd->Instance);
	(void)SDIO_PowerState_OFF(obj->hsd->Instance);
    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_FORCE_RESET();
        __HAL_RCC_SDMMC1_RELEASE_RESET();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_FORCE_RESET();
        __HAL_RCC_SDMMC2_RELEASE_RESET();
    }
    #endif
//ANN added below
    #if defined (SDIO)
    {
    	 __HAL_RCC_SDIO_FORCE_RESET();
    	 __HAL_RCC_SDIO_RELEASE_RESET();
    }
	#endif
}


/***************************************************************************************************
 * _stm32_sdio_find_optimal_block_size
 **************************************************************************************************/
static  uint32_t _stm32_sdio_find_optimal_block_size(uint32_t data_size)
{
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_256B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_512B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_128B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_256B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_64B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_128B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_32B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_64B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_16B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_32B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_8B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_16B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_4B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_8B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_2B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_4B;
    }
    return _CYHAL_SDIO_DATA_BLOCK_SIZE_4B;
}


/***************************************************************************************************
 * _stm32_sdio_convert_block_size
 **************************************************************************************************/
static uint32_t _stm32_sdio_convert_block_size(uint16_t block_size)
{
    switch (block_size)
    {
        case 1:
            return SDIO_DATABLOCK_SIZE_1B;

        case 2:
            return SDIO_DATABLOCK_SIZE_2B;

        case 4:
            return SDIO_DATABLOCK_SIZE_4B;

        case 8:
            return SDIO_DATABLOCK_SIZE_8B;

        case 16:
            return SDIO_DATABLOCK_SIZE_16B;

        case 32:
            return SDIO_DATABLOCK_SIZE_32B;

        case 64:
            return SDIO_DATABLOCK_SIZE_64B;

        case 128:
            return SDIO_DATABLOCK_SIZE_128B;

        case 256:
            return SDIO_DATABLOCK_SIZE_256B;

        case 512:
            return SDIO_DATABLOCK_SIZE_512B;

        case 1024:
            return SDIO_DATABLOCK_SIZE_1024B;

        case 2048:
            return SDIO_DATABLOCK_SIZE_2048B;

        case 4096:
            return SDIO_DATABLOCK_SIZE_4096B;

        case 8192:
            return SDIO_DATABLOCK_SIZE_8192B;

        case 16384:
            return SDIO_DATABLOCK_SIZE_16384B;

        default:
            assert_param(false); /* wrong value */
            return SDIO_DATABLOCK_SIZE_512B;
    }
}


/***************************************************************************************************
 * _stm32_sdio_enable_irq
 **************************************************************************************************/
static void _stm32_sdio_enable_irq(const SD_TypeDef* instance, uint32_t priority, bool en_irq)
{
    IRQn_Type IRQn = (IRQn_Type)0;

    if (instance == SDIO)
       {
           IRQn = SDIO_IRQn;
       }

    #if defined (SDMMC1)
    if (instance == SDMMC1)
    {
        IRQn = SDMMC1_IRQn;
    }
    else
    #endif

    #if defined (SDMMC2)
    if (instance == SDMMC2)
    {
        IRQn = SDMMC2_IRQn;
    }


    #endif

    else
    {
        assert_param(false); // wrong instance
    }

